src/cf/InformationRegisters/УдалитьСкриптыСхемКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УдалитьСкриптыСхемКомплексныхПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скрипт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьСхемыКомплексныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСкрипта</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УдалитьСкриптыСхемКомплексныхПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Получает скрипт (выражение на встроенном языке) по схеме и идентификатору.
//
// Параметры:
//  Схема - СправочникСсылка.СхемыКомплексныхПроцессов - ссылка на схему, в которой
//          используется текущей скрипт.
//  ИдентификаторСкрипта - Уникальный Идентификатор - Идентификатор скрипта в разрезе схемы.
//
// Возвращаемое значение:
//  Строка - скрипт (выражение на встроенном языке).
//
Функция СкриптСхемы(Схема, ИдентификаторСкрипта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Скрипт = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдалитьСкриптыСхемКомплексныхПроцессов.Скрипт
		|ИЗ
		|	РегистрСведений.УдалитьСкриптыСхемКомплексныхПроцессов КАК УдалитьСкриптыСхемКомплексныхПроцессов
		|ГДЕ
		|	УдалитьСкриптыСхемКомплексныхПроцессов.Схема = &Схема
		|	И УдалитьСкриптыСхемКомплексныхПроцессов.ИдентификаторСкрипта = &ИдентификаторСкрипта";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("ИдентификаторСкрипта", ИдентификаторСкрипта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Скрипт = Выборка.Скрипт;
	КонецЕсли;
	
	Возврат Скрипт;
	
КонецФункции

#КонецЕсли
